
&НаКлиенте
Процедура Отправить(Команда)
	Закрыть(СокрЛП(ТекстОтвета));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ТекстОтвета = Символы.ПС + СокрЛП(Справочники.ШаблоныТекстовПисем.ПолучитьТекстШаблона(ВстроеннаяПочтаСерверПовтИсп.ПолучитьПерсональнуюНастройку("ПодписьДляНовыхПисем")));
	ТекстОтвета = Символы.ПС + СокрЛП(ПараметрыСеанса.ТекущийПользователь.Комментарий);
КонецПроцедуры            


&НаКлиенте
Асинх Процедура ПриВставкеИзБуфераОбмена(Значение, СтандартнаяОбработка)
	
	//Если установить Ложь, то глобальное событие вызываться не будет
	//НО, в Асинх методах такое не работает. Поэтому надо сначала убрать Асинх
	//СтандартнаяОбработка = Ложь;

	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Коллекция = Значение;
	Иначе
		Коллекция = Новый Массив;
		Коллекция.Добавить(Значение);
	КонецЕсли;
	
	Для Каждого Элемент Из Коллекция Цикл
		
		ТипЭлемента = ТипЗнч(Элемент);
		
		НоваяСтрока = ПриВставкеИзБуфераОбменаДанные.Добавить();
		НоваяСтрока.Тип = ТипЭлемента;
		
		Если ТипЭлемента = Тип("Картинка") Тогда
			НоваяСтрока.АдресКартинки = ПоместитьВоВременноеХранилище(Элемент, УникальныйИдентификатор);
		ИначеЕсли ТипЭлемента = Тип("СсылкаНаФайл") Тогда
			НоваяСтрока.ПолноеИмяФайла = Элемент.Файл.ПолноеИмя;
			НоваяСтрока.СодержимоеФайла = Ждать Элемент.ПолучитьКакСтрокуАсинх();
			НоваяСтрока.ДвоичныеДанные = ПолучитьHexСтрокуИзДвоичныхДанных(
				Ждать Элемент.ПолучитьКакДвоичныеДанныеАсинх());
		КонецЕсли;	
		
	КонецЦикла;
	
	//ПриВставкеИзБуфераОбменаДанныеПриАктивизацииСтроки();
	
КонецПроцедуры
