
Процедура ПередЗаписью(Отказ)   
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//АдресацияИсполнитель = Исполнитель;
	
	Если (Ссылка.Статус <> Статус) 
		И НЕ ЭтоНовый() И Статус = Справочники.СтатусЗадачНаВыполнение.ПолученОтвет Тогда // Оповестить об ответе
		
		ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент();
		
		НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НовСтрПолучатель.Адресат = млкПодпискиНаСобытия.ПолучитьАдресат(АдресацияИсполнитель);
		
		ИсходящееПисьмо.Тема = Тема + " [#" + Номер + "]";
		
		ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]
		|По задаче  " + Номер + " получен ответ. 
		|Статус изменен на: " + Статус.Наименование + Символы.ПС + "
		|
		|Содержание: " +  Содержание);
		
		ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
		ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		ТекДата = ТекущаяДата();
		ИсходящееПисьмо.Дата = ТекДата;			
		ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
		ИсходящееПисьмо.ПодготовленоКОтправке  = ТекДата;
		ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		ИсходящееПисьмо.Записать();  
				
	ИначеЕсли (Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель ИЛИ Ссылка.Статус <> Статус) 
		И НЕ ЭтоНовый() И НЕ Статус = Справочники.СтатусЗадачНаВыполнение.Выполнена Тогда // Оповестить об изменении
		
		Если Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда
			НП = Получатели.Добавить();
			НП.Адресат = млкПодпискиНаСобытия.ПолучитьАдресат(АдресацияИсполнитель);
			НП.Оповещать = Истина;
		КонецЕсли;	
		
		ИсходящееПисьмо = Документы.ИсходящееПисьмо.СоздатьДокумент();
		
		НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НовСтрПолучатель.Адресат = Инициатор;
		
		Для Каждого Стр ИЗ Получатели Цикл
			НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
			НовСтрПолучатель.Адресат = Стр.Адресат;
		КонецЦикла;	
		
		НовСтрПолучатель = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НовСтрПолучатель.Адресат = млкПодпискиНаСобытия.ПолучитьАдресат(АдресацияИсполнитель);
		
		ИсходящееПисьмо.Тема = Тема + " [#" + Номер + "]";
		Если Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель И Ссылка.Статус <> Статус Тогда
			ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]
			|Назначена на исполнение сотруднику: " + АдресацияИсполнитель.Наименование + Символы.ПС + "
			|Статус изменен на: " + Статус.Наименование + Символы.ПС + "
			|
			|Содержание: " +  Содержание);  

		ИначеЕсли Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда
			ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]" + Символы.ПС + "
			|Назначена на исполнение сотруднику: " + АдресацияИсполнитель.Наименование  + Символы.ПС + "
			|
			|Содержание: " +  Содержание);   
		ИначеЕсли Ссылка.Статус <> Статус Тогда
			ХранилищеТекста = Новый ХранилищеЗначения("Задача  [#" + Номер + "]" + Символы.ПС + "
			|Статус изменен на: " + Статус.Наименование + Символы.ПС + "
			|
			|Содержание: " +  Содержание);    
		КонецЕсли;	
		
		ТекДата = ТекущаяДата();
		ИсходящееПисьмо.Дата = ТекДата;			
		ИсходящееПисьмо.ТекстХранилище = ХранилищеТекста;
		ИсходящееПисьмо.ПодготовленоКОтправке  = ТекДата;
		ИсходящееПисьмо.УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
		ИсходящееПисьмо.Записать();
		Если Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Файлы.Ссылка
			|ИЗ
			|	Справочник.Файлы КАК Файлы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗаявкаНаВыполнение.Письма КАК ЗаявкаНаВыполнениеПисьма
			|		ПО Файлы.ВладелецФайла = ЗаявкаНаВыполнениеПисьма.Письмо
			|ГДЕ
			|	ЗаявкаНаВыполнениеПисьма.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Файл = Выборка.Ссылка.ПолучитьОбъект();
				Версия = Файл.ТекущаяВерсия.ПолучитьОбъект();
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла
				|ИЗ
				|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
				|ГДЕ
				|	ДвоичныеДанныеФайлов.Файл = &ВерсияФайла
				|	И ДвоичныеДанныеФайлов.Файл.Размер > 5000";
				Запрос.УстановитьПараметр("ВерсияФайла",Версия.Ссылка);
				ВыборкаДанных = Запрос.Выполнить().Выбрать();
				Если ВыборкаДанных.Следующий() Тогда
					НовыйФайл = Файл.Скопировать();
					НовыйФайл.ВладелецФайла = ИсходящееПисьмо.Ссылка;
					НовыйФайл.Записать();
					
					НоваяВерсия = Версия.Скопировать();
					НоваяВерсия.Владелец = НовыйФайл.Ссылка;
					АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Версия.ФайлХранилище.Получить(), Новый УникальныйИдентификатор());
					НоваяВерсия.ФайлХранилище = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
					НоваяВерсия.Записать();
					
					НовыйФайл.ТекущаяВерсия = НоваяВерсия.Ссылка;
					НовыйФайл.ТекущаяВерсияКод = НоваяВерсия.Код;
					НовыйФайл.Записать();
					
					Набор = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьНаборЗаписей();
					Набор.Отбор.Файл.Установить(НоваяВерсия.Ссылка);
					Запись = Набор.Добавить();
					Запись.Файл = НоваяВерсия.Ссылка;
					Запись.ДвоичныеДанныеФайла = ВыборкаДанных.ДвоичныеДанныеФайла;
					Набор.Записать();
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;	
	КонецЕсли;	  
	
	//Создадим данные для отражения изменения.
	Изменения = Новый Структура("ЕстьИзменения,Статус,Исполнитель,ПрежнийСтатус,ПрежнийИсполнитель");   
	Изменения.ЕстьИзменения = Ложь;
	
	Если Ссылка.Статус <> Статус 
		И Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель Тогда // Оповестить об ответе
		
            Изменения.ЕстьИзменения = Истина;
	        Изменения.Статус = Статус; 
			Изменения.Исполнитель = АдресацияИсполнитель;
			Изменения.ПрежнийСтатус = Ссылка.Статус; 
			Изменения.ПрежнийИсполнитель = Ссылка.АдресацияИсполнитель;
		
	ИначеЕсли (Ссылка.АдресацияИсполнитель <> АдресацияИсполнитель) Тогда // Оповестить об изменении
		
		    Изменения.ЕстьИзменения = Истина;
			Изменения.Исполнитель = АдресацияИсполнитель;
			Изменения.ПрежнийИсполнитель = Ссылка.АдресацияИсполнитель;  
			
	ИначеЕсли Ссылка.Статус <> Статус Тогда	
			
			Изменения.ЕстьИзменения = Истина;
	        Изменения.Статус = Статус; 
			Изменения.ПрежнийСтатус = Ссылка.Статус; 
		
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("Изменения",Изменения);  	
КонецПроцедуры

Процедура ПриВыполнении(Отказ) 
	
	Статус = Справочники.СтатусЗадачНаВыполнение.Выполнена;
	Если НЕ ЗначениеЗаполнено(ДатаВыполнения) Тогда
		ДатаВыполнения = ТекущаяДата();     
	КонецЕсли;    
	
	Если не ЗначениеЗаполнено(Решение) Тогда
		Отказ = Истина;
		Сообщить("Для выполнения необходимо заполнить решение");
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)     
	Если ДополнительныеСвойства.Изменения.ЕстьИзменения Тогда  
		МенеджерЗаписи = РегистрыСведений.ИсторияЗаявокНаВыполнение.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДатаВремя = ТекущаяДата();  
		МенеджерЗаписи.ЗаявкаНаВыполнение = Ссылка;
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ДополнительныеСвойства.Изменения);		
		МенеджерЗаписи.Записать();
	КонецЕсли;	
КонецПроцедуры
